Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/edc/PIC32MK0512MCJ064.PIC
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="f31" edc:desc="" edc:impl="0xffffffffffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000000000000000000000000000000000000000000000000000" edc:name="f31" edc:nmmrflags="St" edc:nmmrid="1528" edc:nzwidth="0x40" edc:por="0000000000000000000000000000000000000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="f31" edc:desc="" edc:mask="0xffffffffffffffff" edc:name="f31" edc:nzwidth="0x40"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="---r---rrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="FIR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00010001111100111010011100000000" edc:name="FIR" edc:nmmrflags="0t" edc:nmmrid="1536" edc:nzwidth="0x20" edc:por="00010001111100111010011100000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="Revision" edc:desc="" edc:mask="0xff" edc:name="Revision" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="ProcessorID" edc:desc="" edc:mask="0xff" edc:name="ProcessorID" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="S" edc:desc="" edc:mask="0x1" edc:name="S" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="D" edc:desc="" edc:mask="0x1" edc:name="D" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PS" edc:desc="" edc:mask="0x1" edc:name="PS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MIPS_3D" edc:desc="" edc:mask="0x1" edc:name="MIPS_3D" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="W" edc:desc="" edc:mask="0x1" edc:name="W" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="L" edc:desc="" edc:mask="0x1" edc:name="L" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="F64" edc:desc="" edc:mask="0x1" edc:name="F64" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Has2008" edc:desc="" edc:mask="0x1" edc:name="Has2008" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FC" edc:desc="" edc:mask="0x1" edc:name="FC" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="UFRP" edc:desc="" edc:mask="0x1" edc:name="UFRP" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="------------------------nnnnnnnn" edc:cname="FCCR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="FCCR" edc:nmmrflags="0t" edc:nmmrid="1636" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FCC" edc:desc="" edc:mask="0xff" edc:name="FCC" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="--------------nnnnnn-----nnnnn--" edc:cname="FEXR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="FEXR" edc:nmmrflags="0t" edc:nmmrid="1640" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="FLAGS" edc:desc="" edc:mask="0x1f" edc:name="FLAGS" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="CAUSE" edc:desc="" edc:mask="0x3f" edc:name="CAUSE" edc:nzwidth="0x6"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="FLAGS_I" edc:desc="" edc:mask="0x1" edc:name="FLAGS_I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLAGS_U" edc:desc="" edc:mask="0x1" edc:name="FLAGS_U" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLAGS_O" edc:desc="" edc:mask="0x1" edc:name="FLAGS_O" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLAGS_Z" edc:desc="" edc:mask="0x1" edc:name="FLAGS_Z" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLAGS_V" edc:desc="" edc:mask="0x1" edc:name="FLAGS_V" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="CAUSE_I" edc:desc="" edc:mask="0x1" edc:name="CAUSE_I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAUSE_U" edc:desc="" edc:mask="0x1" edc:name="CAUSE_U" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAUSE_O" edc:desc="" edc:mask="0x1" edc:name="CAUSE_O" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAUSE_Z" edc:desc="" edc:mask="0x1" edc:name="CAUSE_Z" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAUSE_V" edc:desc="" edc:mask="0x1" edc:name="CAUSE_V" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAUSE_E" edc:desc="" edc:mask="0x1" edc:name="CAUSE_R" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="--------------------nnnnn----rnn" edc:cname="FENR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="FENR" edc:nmmrflags="0t" edc:nmmrid="1648" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RM" edc:desc="" edc:mask="0x3" edc:name="RM" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FS" edc:desc="" edc:mask="0x1" edc:name="FS" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="ENABLES" edc:desc="" edc:mask="0x1f" edc:name="ENABLES" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="ENABLES_I" edc:desc="" edc:mask="0x1" edc:name="ENABLES_I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLES_U" edc:desc="" edc:mask="0x1" edc:name="ENABLES_U" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLES_O" edc:desc="" edc:mask="0x1" edc:name="ENABLES_O" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLES_Z" edc:desc="" edc:mask="0x1" edc:name="ENABLES_Z" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLES_V" edc:desc="" edc:mask="0x1" edc:name="ENABLES_V" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-M5150-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnrrrnnnnnnnnnnnnnnnnnn" edc:cname="FCSR" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000011000000000000000000" edc:name="FCSR" edc:nmmrflags="0t" edc:nmmrid="1660" edc:nzwidth="0x20" edc:por="00000000000011000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RM" edc:desc="" edc:mask="0x3" edc:name="RM" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLAGS" edc:desc="" edc:mask="0x1F" edc:name="FLAGS" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="ENABLES" edc:desc="" edc:mask="0x1f" edc:name="ENABLES" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="CAUSE" edc:desc="" edc:mask="0x3f" edc:name="CAUSE" edc:nzwidth="0x6"/>
            <edc:SFRFieldDef edc:cname="NAN2008" edc:desc="" edc:mask="0x1" edc:name="NAN2008" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ABS2008" edc:desc="" edc:mask="0x1" edc:name="ABS2008" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MAC2008" edc:desc="" edc:mask="0x1" edc:name="MAC2008" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FN" edc:desc="" edc:mask="0x1" edc:name="FN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FO" edc:desc="" edc:mask="0x1" edc:name="FO" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCC0" edc:desc="" edc:mask="0x1" edc:name="FCC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FS" edc:desc="" edc:mask="0x1" edc:name="FS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FCC" edc:desc="" edc:mask="0x5f" edc:name="FCC" edc:nzwidth="0x7"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.1">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="FLAGS_I" edc:desc="" edc:mask="0x1" edc:name="FLAGS_I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLAGS_U" edc:desc="" edc:mask="0x1" edc:name="FLAGS_U" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLAGS_O" edc:desc="" edc:mask="0x1" edc:name="FLAGS_O" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLAGS_Z" edc:desc="" edc:mask="0x1" edc:name="FLAGS_Z" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FLAGS_V" edc:desc="" edc:mask="0x1" edc:name="FLAGS_V" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLES_I" edc:desc="" edc:mask="0x1" edc:name="ENABLES_I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLES_U" edc:desc="" edc:mask="0x1" edc:name="ENABLES_U" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLES_O" edc:desc="" edc:mask="0x1" edc:name="ENABLES_O" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLES_Z" edc:desc="" edc:mask="0x1" edc:name="ENABLES_Z" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLES_V" edc:desc="" edc:mask="0x1" edc:name="ENABLES_V" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAUSE_I" edc:desc="" edc:mask="0x1" edc:name="CAUSE_I" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAUSE_U" edc:desc="" edc:mask="0x1" edc:name="CAUSE_U" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAUSE_O" edc:desc="" edc:mask="0x1" edc:name="CAUSE_O" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAUSE_Z" edc:desc="" edc:mask="0x1" edc:name="CAUSE_Z" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAUSE_V" edc:desc="" edc:mask="0x1" edc:name="CAUSE_V" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAUSE_E" edc:desc="" edc:mask="0x1" edc:name="CAUSE_R" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
