Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.84/edc/PIC32MK0512MCJ064.PIC
      <edc:SFRDef edc:_addr="0x1F810040" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="nn--nnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS0" edc:desc="" edc:impl="0xcfffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--0000000000000000000000000000" edc:name="IFS0" edc:nzwidth="32" edc:por="00--0000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CTIF" edc:desc="" edc:mask="0x1" edc:name="CTIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS0IF" edc:desc="" edc:mask="0x1" edc:name="CS0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CS1IF" edc:desc="" edc:mask="0x1" edc:name="CS1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT0IF" edc:desc="" edc:mask="0x1" edc:name="INT0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T1IF" edc:desc="" edc:mask="0x1" edc:name="T1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1EIF" edc:desc="" edc:mask="0x1" edc:name="IC1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC1IF" edc:desc="" edc:mask="0x1" edc:name="IC1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC1IF" edc:desc="" edc:mask="0x1" edc:name="OC1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT1IF" edc:desc="" edc:mask="0x1" edc:name="INT1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T2IF" edc:desc="" edc:mask="0x1" edc:name="T2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2EIF" edc:desc="" edc:mask="0x1" edc:name="IC2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2IF" edc:desc="" edc:mask="0x1" edc:name="IC2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC2IF" edc:desc="" edc:mask="0x1" edc:name="OC2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT2IF" edc:desc="" edc:mask="0x1" edc:name="INT2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T3IF" edc:desc="" edc:mask="0x1" edc:name="T3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3EIF" edc:desc="" edc:mask="0x1" edc:name="IC3EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3IF" edc:desc="" edc:mask="0x1" edc:name="IC3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC3IF" edc:desc="" edc:mask="0x1" edc:name="OC3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT3IF" edc:desc="" edc:mask="0x1" edc:name="INT3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T4IF" edc:desc="" edc:mask="0x1" edc:name="T4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4EIF" edc:desc="" edc:mask="0x1" edc:name="IC4EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC4IF" edc:desc="" edc:mask="0x1" edc:name="IC4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC4IF" edc:desc="" edc:mask="0x1" edc:name="OC4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="INT4IF" edc:desc="" edc:mask="0x1" edc:name="INT4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T5IF" edc:desc="" edc:mask="0x1" edc:name="T5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5EIF" edc:desc="" edc:mask="0x1" edc:name="IC5EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5IF" edc:desc="" edc:mask="0x1" edc:name="IC5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC5IF" edc:desc="" edc:mask="0x1" edc:name="OC5IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="RTCCIF" edc:desc="" edc:mask="0x1" edc:name="RTCCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FCEIF" edc:desc="" edc:mask="0x1" edc:name="FCEIF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xcfffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810050" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="--nnnnnnnnn--nnnnnnnnnnnnnnnn-nn" edc:cname="IFS1" edc:desc="" edc:impl="0x3fe7dffb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000000--0000000000000000-00" edc:name="IFS1" edc:nzwidth="32" edc:por="--000000000--0000000000000000-00" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP1IF" edc:desc="" edc:mask="0x1" edc:name="CMP1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP2IF" edc:desc="" edc:mask="0x1" edc:name="CMP2IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SPI1EIF" edc:desc="" edc:mask="0x1" edc:name="SPI1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI1TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1EIF" edc:desc="" edc:mask="0x1" edc:name="U1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1RXIF" edc:desc="" edc:mask="0x1" edc:name="U1RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1TXIF" edc:desc="" edc:mask="0x1" edc:name="U1TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1BIF" edc:desc="" edc:mask="0x1" edc:name="I2C1BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1SIF" edc:desc="" edc:mask="0x1" edc:name="I2C1SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C1MIF" edc:desc="" edc:mask="0x1" edc:name="I2C1MIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNAIF" edc:desc="" edc:mask="0x1" edc:name="CNAIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNBIF" edc:desc="" edc:mask="0x1" edc:name="CNBIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNCIF" edc:desc="" edc:mask="0x1" edc:name="CNCIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNDIF" edc:desc="" edc:mask="0x1" edc:name="CNDIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNEIF" edc:desc="" edc:mask="0x1" edc:name="CNEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNFIF" edc:desc="" edc:mask="0x1" edc:name="CNFIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CNGIF" edc:desc="" edc:mask="0x1" edc:name="CNGIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="SPI2EIF" edc:desc="" edc:mask="0x1" edc:name="SPI2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2EIF" edc:desc="" edc:mask="0x1" edc:name="U2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2RXIF" edc:desc="" edc:mask="0x1" edc:name="U2RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2TXIF" edc:desc="" edc:mask="0x1" edc:name="U2TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2BIF" edc:desc="" edc:mask="0x1" edc:name="I2C2BIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2SIF" edc:desc="" edc:mask="0x1" edc:name="I2C2SIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="I2C2MIF" edc:desc="" edc:mask="0x1" edc:name="I2C2MIF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810060" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="nn-nnnnnnnnnnnnnnnnnnnnnn-------" edc:cname="IFS2" edc:desc="" edc:impl="0xdfffff80" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0u-0000000000000000000000-------" edc:name="IFS2" edc:nzwidth="32" edc:por="0x-0000000000000000000000-------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="CTMUIF" edc:desc="" edc:mask="0x1" edc:name="CTMUIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA0IF" edc:desc="" edc:mask="0x1" edc:name="DMA0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA1IF" edc:desc="" edc:mask="0x1" edc:name="DMA1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA2IF" edc:desc="" edc:mask="0x1" edc:name="DMA2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA3IF" edc:desc="" edc:mask="0x1" edc:name="DMA3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T6IF" edc:desc="" edc:mask="0x1" edc:name="T6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC6EIF" edc:desc="" edc:mask="0x1" edc:name="IC6EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC6IF" edc:desc="" edc:mask="0x1" edc:name="IC6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC6IF" edc:desc="" edc:mask="0x1" edc:name="OC6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T7IF" edc:desc="" edc:mask="0x1" edc:name="T7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC7EIF" edc:desc="" edc:mask="0x1" edc:name="IC7EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC7IF" edc:desc="" edc:mask="0x1" edc:name="IC7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC7IF" edc:desc="" edc:mask="0x1" edc:name="OC7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T8IF" edc:desc="" edc:mask="0x1" edc:name="T8IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC8EIF" edc:desc="" edc:mask="0x1" edc:name="IC8EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC8IF" edc:desc="" edc:mask="0x1" edc:name="IC8IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC8IF" edc:desc="" edc:mask="0x1" edc:name="OC8IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="T9IF" edc:desc="" edc:mask="0x1" edc:name="T9IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC9EIF" edc:desc="" edc:mask="0x1" edc:name="IC9EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC9IF" edc:desc="" edc:mask="0x1" edc:name="IC9IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="OC9IF" edc:desc="" edc:mask="0x1" edc:name="OC9IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1IF" edc:desc="" edc:mask="0x1" edc:name="AD1IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1DC1IF" edc:mask="0x1" edc:name="AD1DC1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1DC2IF" edc:desc="" edc:mask="0x1" edc:name="AD1DC2IF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810070" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IFS3" edc:desc="" edc:impl="0x3fffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--00000000000000000u0000u0000000" edc:name="IFS3" edc:nzwidth="32" edc:por="--00000000000000000x0000x0000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="AD1DF1IF" edc:desc="" edc:mask="0x1" edc:name="AD1DF1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1DF2IF" edc:desc="" edc:mask="0x1" edc:name="AD1DF2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1DF3IF" edc:desc="" edc:mask="0x1" edc:name="AD1DF3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1DF4IF" edc:desc="" edc:mask="0x1" edc:name="AD1DF4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1FIIF" edc:desc="" edc:mask="0x1" edc:name="AD1FIIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1EOSIF" edc:desc="" edc:mask="0x1" edc:name="AD1EOSIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1ARIF" edc:desc="" edc:mask="0x1" edc:name="AD1ARIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1RSIF" edc:mask="0x1" edc:name="AD1RSIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1FCBTIF" edc:desc="" edc:mask="0x1" edc:name="AD1FCBTIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1GIF" edc:desc="" edc:mask="0x1" edc:name="AD1GIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D0IF" edc:desc="" edc:mask="0x1" edc:name="AD1D0IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D1IF" edc:desc="" edc:mask="0x1" edc:name="AD1D1IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D2IF" edc:desc="" edc:mask="0x1" edc:name="AD1D2IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D3IF" edc:desc="" edc:mask="0x1" edc:name="AD1D3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D4IF" edc:desc="" edc:mask="0x1" edc:name="AD1D4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D5IF" edc:desc="" edc:mask="0x1" edc:name="AD1D5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D6IF" edc:desc="" edc:mask="0x1" edc:name="AD1D6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D7IF" edc:desc="" edc:mask="0x1" edc:name="AD1D7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D8IF" edc:desc="" edc:mask="0x1" edc:name="AD1D8IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D9IF" edc:desc="" edc:mask="0x1" edc:name="AD1D9IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D10IF" edc:desc="" edc:mask="0x1" edc:name="AD1D10IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D11IF" edc:desc="" edc:mask="0x1" edc:name="AD1D11IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D12IF" edc:desc="" edc:mask="0x1" edc:name="AD1D12IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D13IF" edc:desc="" edc:mask="0x1" edc:name="AD1D13IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D14IF" edc:desc="" edc:mask="0x1" edc:name="AD1D14IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D15IF" edc:desc="" edc:mask="0x1" edc:name="AD1D15IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D16IF" edc:desc="" edc:mask="0x1" edc:name="AD1D16IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D17IF" edc:desc="" edc:mask="0x1" edc:name="AD1D17IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D18IF" edc:desc="" edc:mask="0x1" edc:name="AD1D18IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D19IF" edc:desc="" edc:mask="0x1" edc:name="AD1D19IF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810080" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="nnnnnnnn----nn------------nnnn--" edc:cname="IFS4" edc:desc="" edc:impl="0xff0c003c" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000----00------------0000--" edc:name="IFS4" edc:nzwidth="32" edc:por="00000000----00------------0000--" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="AD1D24IF" edc:desc="" edc:mask="0x1" edc:name="AD1D24IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D25IF" edc:desc="" edc:mask="0x1" edc:name="AD1D25IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D26IF" edc:desc="" edc:mask="0x1" edc:name="AD1D21IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D27IF" edc:desc="" edc:mask="0x1" edc:name="AD1D27IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="12"/>
            <edc:SFRFieldDef edc:cname="AD1D40IF" edc:desc="" edc:mask="0x1" edc:name="AD1D40IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D41IF" edc:desc="" edc:mask="0x1" edc:name="AD1D41IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="AD1D46IF" edc:desc="" edc:mask="0x1" edc:name="AD1D46IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D47IF" edc:desc="" edc:mask="0x1" edc:name="AD1D47IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D48IF" edc:desc="" edc:mask="0x1" edc:name="AD1D48IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D49IF" edc:desc="" edc:mask="0x1" edc:name="AD1D49IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D50IF" edc:desc="" edc:mask="0x1" edc:name="AD1D50IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D51IF" edc:desc="" edc:mask="0x1" edc:name="AD1D51IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D52IF" edc:desc="" edc:mask="0x1" edc:name="AD1D52IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="AD1D53IF" edc:desc="" edc:mask="0x1" edc:name="AD1D53IF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810090" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02907_WACN_MC_int_evic_v3.Module" edc:_refcount="1" edc:access="--n---nnnn---nnnnnnnnnn-n----nnn" edc:cname="IFS5" edc:desc="" edc:impl="0x23c7fe87" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--u---0000---uuuuuuuuuu-0----000" edc:name="IFS5" edc:nzwidth="32" edc:por="--x---0000---xxxxxxxxxx-0----000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CMP3IF" edc:desc="" edc:mask="0x1" edc:name="CMP3IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP4IF" edc:desc="" edc:mask="0x1" edc:name="CMP4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="CMP5IF" edc:desc="" edc:mask="0x1" edc:name="CMP5IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:SFRFieldDef edc:cname="CAN1IF" edc:desc="" edc:mask="0x1" edc:name="CAN1IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="QEI1IF" edc:mask="0x1" edc:name="QEI1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="QEI2IF" edc:mask="0x1" edc:name="QEI2IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMPEVTIF" edc:mask="0x1" edc:name="PWMPEVTIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWMSEVTIF" edc:mask="0x1" edc:name="PWMSEVTIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM1IF" edc:mask="0x1" edc:name="PWM1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM2IF" edc:mask="0x1" edc:name="PWM2IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM3IF" edc:mask="0x1" edc:name="PWM3IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM4IF" edc:mask="0x1" edc:name="PWM4IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM5IF" edc:mask="0x1" edc:name="PWM5IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PWM6IF" edc:mask="0x1" edc:name="PWM6IF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA4IF" edc:desc="" edc:mask="0x1" edc:name="DMA4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA5IF" edc:desc="" edc:mask="0x1" edc:name="DMA5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA6IF" edc:desc="" edc:mask="0x1" edc:name="DMA6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA7IF" edc:desc="" edc:mask="0x1" edc:name="DMA7IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="QEI3IF" edc:mask="0x1" edc:name="QEI3IF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
